//REPLACESAL  JOB (ACCOUNT),'Replace Salary',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//STEP01     EXEC PGM=SORT
//SYSPRINT   DD  SYSOUT=*
//SORTIN     DD  DISP=SHR,DSN=YOUR.INPUT.FILE /* Input VB file */
//SORTOUT    DD  DISP=(NEW,CATLG,DELETE), 
//             DSN=YOUR.OUTPUT.FILE, 
//             SPACE=(CYL,(1,1),RLSE),
//             DCB=(RECFM=VB,LRECL=84,BLKSIZE=0)
//SYSIN      DD *
  OPTION COPY
  INREC IFTHEN=(WHEN=INIT,OVERLAY=(25:+0,TO=PD,LENGTH=4)) /* Replace salary field */
/*
